<template>
	<div id="contain">
		<detail-header></detail-header>
		<div class="content">
			<detail-content
				:first="detail[$route.params.id].first"
				:second="detail[$route.params.id].second"
				:u="$route.params.id"
			></detail-content>
		</div>
	</div>
</template>
<script type="text/javascript">
	import DetailHeader from '../components/DetailHeader'
	import DetailContent from '../components/DetailContent'
	export default {
		template:"<DetailContent />",
		data(){
			return {
				detail:[
					{
						first:'《大学》是一篇论述儒家修身治国平天下思想的散文，原是《小戴礼记》第四十二篇，相传为曾子所作，实为秦汉时儒家作品，是一部中国古代讨论教育理论的重要著作。',
						second:'《大学》出自《礼记》，原本是《礼记》四十九篇中的第四十二篇。《礼记》原名《小戴礼记》，又名《小戴记》，由汉宣帝时人戴圣根据历史上遗留下来的一批佚名儒家的著作合编而成。据断代史学家班固在“《记》百三十一篇”下自注云“七十子后学者所记也”，他认为《礼记》各篇的成书年代主要分布在战国初期至西汉初期这段时间。清代人崔述认为：“凡文之体，因乎其时……《大学》之文繁而尽，又多排语，计其时当在战国。”（《洙泗考信录·全录》）综合而论，《大学》的成书时代大体在孔子、曾子之后，孟子、荀子之前的战国前期，即公元前5世纪左右，系出于曾氏之儒一派的纯儒家作品”。即《大学》的成书年代应是在战国初期，其作者应是“曾氏之儒一派”，即现在学术界比较认可的战国初期曾参所作。'
					},{
						first:'中庸，儒家的道德标准，中庸，中用，庸古同用。待人接物保持中正平和，因时制宜、因物制宜、因事制宜、因地制宜，儒家的理论根源源于人性。',
						second:'《中庸》是儒家经典的《四书》之一。原是《礼记》第三十一篇，内文的写成约在战国末期至西汉之间，作者是谁尚无定论，一说是孔伋所作（子思著《中庸》），载于另一说是秦代或汉代的学者所作。宋朝的儒学家对中庸非常推崇而将其从《礼记》中抽出独立成书，朱熹则将其与《论语》、《孟子》、《大学》合编为《四书》。'
					},{
						first:'《论语》由孔子弟子及再传弟子编写而成，至汉代成书。主要记录孔子及其弟子的言行，较为集中地反映了孔子的思想，是儒家学派的经典著作之一。',
						second:'以语录体为主，叙事体为辅，集中体现了孔子的政治主张、伦理思想、道德观念及教育原则等。与《大学》、《中庸》、《孟子》并称“四书”，与《诗》、《书》、《礼》、《易》、《春秋》等“五经”，总称“四书五经”。全书共20篇、492章，首创 “语录体” 。是中国现传扬并学习的古代著作之一。'
					},{
						first:'《孟子》“四书 ”之一。战国中期孟子及其弟子万章、公孙丑等著。为孟子、孟子弟子所作最早见于赵岐《孟子题辞》：“此书，孟子之所作也，故总谓之《孟子》”。',
						second:'《汉书·艺文志》著录《孟子》十一篇，现存七篇十四卷。总字数三万五千余字，286章。相传另有《孟子外书》四篇，已佚（今本《孟子外书》系明姚士粦伪作）。书中记载有孟子及其弟子的政治、教育、哲学、伦理等思想观点和政治活动。古代考试主要考四书五经。'
					},{
						first:'《道德经》是春秋时期老子（李耳）的哲学作品，又称《道德真经》、《老子》、《五千言》、《老子五千文》，是中国古代先秦诸子分家前的一部著作，为其时诸子所共仰，是道家哲学思想的重要来源。',
						second:'《道德经》是中国历史上最伟大的名著之一，对传统哲学、科学、政治、宗教等产生了深刻影响。据联合国教科文组织统计，《道德经》是除了《圣经》以外被译成外国文字发布量最多的文化名著。'
					},{
						first:'《道德经》是春秋时期老子（李耳）的哲学作品，又称《道德真经》、《老子》、《五千言》、《老子五千文》，是中国古代先秦诸子分家前的一部著作，为其时诸子所共仰，是道家哲学思想的重要来源。',
						second:'《道德经》是中国历史上最伟大的名著之一，对传统哲学、科学、政治、宗教等产生了深刻影响。据联合国教科文组织统计，《道德经》是除了《圣经》以外被译成外国文字发布量最多的文化名著。'
					},{
						first:'《金刚般若波罗蜜经》来自印度的初期大乘佛教。因其包含根本般若的重要思想，在般若系大乘经中可视为一个略本；本经说“无相”而不说“空”，保持了原始般若的古风。',
						second:'《金刚经》在印度有唯识家（无著、世亲）的论释。传入中国，三论、天台、贤首、唯识各宗都有注疏；然而中国佛教深受真常唯心一系大乘的影响，各宗表面上阐扬《金刚经》，实际上阐扬常住佛性和如来藏。'
					},{
						first:'传说，后魏李明帝太和年间(公元477—500)，印度达摩来华传教，于河南嵩山少林寺面壁9年，后来少林寺僧人在修缮达摩大师面壁处时，偶得一铁盒，盒中藏有《洗髓》、《易筋》两本经帖：故，《易筋经》传说为达摩所创。另说，易筋经为达摩所创，系伪托。',
						second:'另据清代学者凌廷堪的《校礼堂文集》、周中孚的《郑堂读书记》、康戈武的《中国武术实用大全》、周明和周稔丰的《易筋洗髓经(修订本)》以及《中国大百科全书·体育卷》等书考证，均认为该书籍《易筋经》系明天启四年(1624)天台紫凝道人托名达摩所作。'
					},
				]
			}
		},
		components:{
			DetailHeader,
			DetailContent

		}
	}
</script>
<style type="text/css">
	#contain{
		width:100%;
		height: 100%;
	}
	.content{
		margin-top:5.5rem;
		width:100%;
		height: 100%;
	}
</style>